In [1]:
import numpy as np
import pandas as pd
PREVIOUS_MAX_ROWS = pd.options.display.max_rows
pd.options.display.max_rows = 25
pd.options.display.max_columns = 20
pd.options.display.max_colwidth = 82
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc("figure", figsize=(10, 6))
np.set_printoptions(precision=4, suppress=True)

In [2]:
import numpy as np
import pandas as pd

In [116]:
# Tạo một đối tượng Series (một cấu trúc dữ liệu 1 chiều) của Pandas.
# Series này chứa 4 giá trị: 1.2, -3.5, một giá trị thiếu (Not a Number - NaN) và 0.
float_data = pd.Series([1.2, -3.5, np.nan, 0])

# In ra nội dung của Series vừa tạo.
# Kết quả hiển thị cả giá trị và kiểu dữ liệu (float64).
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [117]:
float_data.isna() # Kiểm tra giá trị thiếu (NaN): Trả về Series Boolean (True/False) cho biết phần tử nào là NaN.

0    False
1    False
2     True
3    False
dtype: bool

In [118]:
# Khởi tạo Series chuỗi chứa các giá trị bình thường, np.nan và None
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])
string_data # Hiển thị Series (NaN và None đều được hiển thị là NaN)
string_data.isna() # Kiểm tra giá trị thiếu (NaN/None): Trả về Series Boolean, đánh dấu True cho cả np.nan và None.

# Khởi tạo Series số thập phân, giá trị None tự động chuyển thành NaN
float_data = pd.Series([1, 2, None], dtype='float64')
float_data # Hiển thị Series (None được chuyển thành NaN)
float_data.isna() # Kiểm tra giá trị thiếu (NaN): Trả về Series Boolean, đánh dấu True cho NaN.

0    False
1    False
2     True
dtype: bool

In [119]:
# Tạo một Series Pandas chứa các số và các giá trị thiếu (NaN)
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

# Loại bỏ các giá trị thiếu (NaN): Trả về một Series mới CHỈ chứa các giá trị hợp lệ (không phải NaN).
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [120]:
data[data.notna()] # Lọc dữ liệu: Chọn ra các phần tử trong Series 'data' KHÔNG phải là NaN (ngược lại của .isna()), loại bỏ các giá trị thiếu.

0    1.0
2    3.5
4    7.0
dtype: float64

In [122]:
# Tạo một DataFrame 4x3 chứa các giá trị số và giá trị thiếu (NaN)
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data # Hiển thị DataFrame

# Loại bỏ các HÀNG (rows) chứa bất kỳ giá trị thiếu (NaN) nào: Chỉ giữ lại các hàng hoàn toàn không có NaN.
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [123]:
data.dropna(how="all") # Loại bỏ các HÀNG (rows) mà TẤT CẢ các giá trị đều là NaN. Giữ lại các hàng có ít nhất một giá trị hợp lệ.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [124]:
# Thêm một cột (column) mới vào DataFrame, đặt tên là '4' (do không chỉ định tên), và gán TẤT CẢ giá trị trong cột này là NaN.
data[4] = np.nan
data # Hiển thị DataFrame mới

# Loại bỏ các CỘT (columns) mà TẤT CẢ các giá trị đều là NaN (tham số axis="columns" hoặc axis=1).
# Cột '4' vừa tạo sẽ bị loại bỏ, các cột khác được giữ lại.
data.dropna(axis="columns", how="all")

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [125]:
# Tạo một DataFrame 7x3 chứa các số ngẫu nhiên theo phân phối chuẩn.
df = pd.DataFrame(np.random.standard_normal((7, 3)))

# Cố tình gán NaN (giá trị thiếu) vào các vị trí cụ thể:
df.iloc[:4, 1] = np.nan # Gán NaN cho 4 hàng đầu tiên (chỉ số 0 đến 3) của Cột 1.
df.iloc[:2, 2] = np.nan # Gán NaN cho 2 hàng đầu tiên (chỉ số 0 và 1) của Cột 2.
df # Hiển thị DataFrame sau khi gán NaN.

# Loại bỏ HÀNG (row) chứa bất kỳ giá trị NaN nào: Giữ lại chỉ các hàng hoàn toàn không có giá trị thiếu.
df.dropna()

# Loại bỏ HÀNG (row) mà có ít hơn 2 giá trị hợp lệ (non-NaN):
# Giữ lại các hàng có ít nhất 2 giá trị HỢP LỆ.
df.dropna(thresh=2)

          0         1         2
2  1.048306       NaN  0.743064
3  1.274748       NaN  0.434976
4  0.794777 -0.216726 -0.026282
5 -0.793404  0.148469  0.045554
6  1.304260 -1.952902  1.413791

In [126]:
df.fillna(0) # Thay thế tất cả các giá trị thiếu (NaN) trong DataFrame 'df' bằng giá trị 0.

          0         1         2
0 -0.457931  0.000000  0.000000
1 -0.318299  0.000000  0.000000
2  1.048306  0.000000  0.743064
3  1.274748  0.000000  0.434976
4  0.794777 -0.216726 -0.026282
5 -0.793404  0.148469  0.045554
6  1.304260 -1.952902  1.413791

In [127]:
df.fillna({1: 0.5, 2: 0}) # Điền giá trị thiếu (NaN) theo cột: Thay thế NaN trong Cột 1 bằng 0.5, và NaN trong Cột 2 bằng 0.

          0         1         2
0 -0.457931  0.500000  0.000000
1 -0.318299  0.500000  0.000000
2  1.048306  0.500000  0.743064
3  1.274748  0.500000  0.434976
4  0.794777 -0.216726 -0.026282
5 -0.793404  0.148469  0.045554
6  1.304260 -1.952902  1.413791

In [128]:
# Import các thư viện cần thiết
import pandas as pd
import numpy as np

# Tạo một DataFrame 6x3 chứa các số ngẫu nhiên.
df = pd.DataFrame(np.random.standard_normal((6, 3)))

# Cố tình gán NaN (giá trị thiếu) vào các vị trí cụ thể:
df.iloc[2:, 1] = np.nan # Gán NaN cho các hàng từ chỉ số 2 đến hết của Cột 1.
df.iloc[4:, 2] = np.nan # Gán NaN cho các hàng từ chỉ số 4 đến hết của Cột 2.
df # Hiển thị DataFrame sau khi gán NaN.

# Điền giá trị thiếu (NaN) bằng cách SỬ DỤNG GIÁ TRỊ HỢP LỆ TRƯỚC ĐÓ (Forward Fill).
df.fillna(method="ffill")

# Điền giá trị thiếu (NaN) bằng cách SỬ DỤNG GIÁ TRỊ HỢP LỆ TRƯỚC ĐÓ, nhưng CHỈ ĐIỀN TỐI ĐA 2 Ô NaN liên tiếp.
df.fillna(method="ffill", limit=2)

C:\Users\Dell\AppData\Local\Temp\ipykernel_5664\139136113.py:14: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")
C:\Users\Dell\AppData\Local\Temp\ipykernel_5664\139136113.py:17: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill", limit=2)

          0         1         2
0 -1.148735  1.381479 -0.794749
1  0.100841 -0.468136 -0.691016
2 -0.289130 -0.468136  0.366186
3  0.509957 -0.468136 -0.067138
4 -0.793903       NaN -0.067138
5 -0.776784       NaN -0.067138

In [129]:
# Tạo một Series Pandas chứa các số và các giá trị thiếu (NaN)
data = pd.Series([1., np.nan, 3.5, np.nan, 7])

# Điền giá trị thiếu (NaN) bằng GIÁ TRỊ TRUNG BÌNH (.mean()) của các giá trị hợp lệ trong Series 'data'.
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [130]:
# Tạo một DataFrame 7x2:
# Cột 'k1' chứa chuỗi lặp lại "one", "two" cùng với một "two" bổ sung ở cuối.
# Cột 'k2' chứa các số lặp lại và duy nhất.
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data # Hiển thị DataFrame vừa tạo.

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [131]:
data.duplicated() # Kiểm tra sự trùng lặp của HÀNG (row): Trả về một Series Boolean, đánh dấu True cho các hàng đã TỪNG XUẤT HIỆN TRƯỚC ĐÓ.

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [132]:
data.drop_duplicates() # Loại bỏ các HÀNG (row) bị trùng lặp: Giữ lại bản sao đầu tiên (first occurrence) của mỗi hàng và loại bỏ tất cả các bản sao sau đó.

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [133]:
# Giả sử DataFrame 'data' đã được tạo
# data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
#                      "k2": [1, 1, 2, 3, 3, 4, 4]})

# Thêm một cột mới tên là "v1" chứa các số từ 0 đến 6 (range(7)).
data["v1"] = range(7)
data # Hiển thị DataFrame mới

# Loại bỏ các HÀNG bị trùng lặp, nhưng CHỈ XEM XÉT sự trùng lặp trong CỘT "k1".
# Nghĩa là, chỉ giữ lại bản sao đầu tiên của mỗi giá trị duy nhất trong cột "k1" ("one" và "two").
data.drop_duplicates(subset=["k1"])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [134]:
data.drop_duplicates(["k1", "k2"], keep="last") # Loại bỏ các HÀNG bị trùng lặp: Chỉ xem xét trùng lặp trên các cột "k1" và "k2", và giữ lại bản sao CUỐI CÙNG (last occurrence) của mỗi hàng duy nhất.

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [135]:
# Tạo một DataFrame 9x2:
# Cột 'food' chứa tên các loại thực phẩm (có nhiều tên bị lặp lại).
# Cột 'ounces' chứa trọng lượng tương ứng của từng món.
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                      "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data # Hiển thị DataFrame vừa tạo.

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [22]:
meat_to_animal = {
  "bacon": "pig",
  "pulled pork": "pig",
  "pastrami": "cow",
  "corned beef": "cow",
  "honey ham": "pig",
  "nova lox": "salmon"
}

In [136]:
# Áp dụng mapping: Tạo cột mới tên "animal" bằng cách sử dụng các giá trị từ cột "food"
# và tra cứu giá trị tương ứng trong mapping 'meat_to_animal'.
data["animal"] = data["food"].map(meat_to_animal)

# Hiển thị DataFrame sau khi thêm cột mới.
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [137]:
# Định nghĩa một hàm Python đơn giản: lấy giá trị 'x' và trả về giá trị tương ứng trong dictionary 'meat_to_animal'.
def get_animal(x):
    return meat_to_animal[x]

# Áp dụng mapping: Lấy từng giá trị từ cột "food", đưa vào hàm 'get_animal' để tra cứu, và trả về một Series mới chứa kết quả ánh xạ.
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [138]:
# Tạo một Series Pandas chứa các số, trong đó có một số giá trị đặc biệt được coi là thiếu/lỗi (-999 và -1000).
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data # Hiển thị Series vừa tạo.

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [139]:
# Thay thế TẤT CẢ các giá trị -999 trong Series 'data' bằng giá trị thiếu chuẩn của Pandas/NumPy là NaN (Not a Number).
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [140]:
# Thay thế nhiều giá trị: Thay thế TẤT CẢ các giá trị -999 và -1000 trong Series 'data' bằng giá trị thiếu chuẩn là NaN.
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [141]:
# Thay thế nhiều giá trị bằng nhiều giá trị khác:
# - Thay thế TẤT CẢ các giá trị -999 bằng NaN (giá trị thiếu chuẩn).
# - Thay thế TẤT CẢ các giá trị -1000 bằng 0.
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [142]:
# Thay thế nhiều giá trị bằng dictionary:
# - Thay thế TẤT CẢ các giá trị -999 bằng NaN.
# - Thay thế TẤT CẢ các giá trị -1000 bằng 0.
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [143]:
# Tạo một DataFrame 3x4:
# - Dữ liệu: Các số nguyên từ 0 đến 11, được sắp xếp thành 3 hàng và 4 cột (dùng np.arange(12).reshape((3, 4))).
# - Chỉ số hàng (index): "Ohio", "Colorado", "New York".
# - Tên cột (columns): "one", "two", "three", "four".
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])

In [144]:
# Định nghĩa một hàm: lấy một chuỗi 'x', cắt lấy 4 ký tự đầu tiên (x[:4]), và chuyển chúng thành chữ IN HOA (.upper()).
def transform(x):
    return x[:4].upper()

# Áp dụng hàm 'transform' cho TẤT CẢ các nhãn (labels) trong chỉ mục hàng (index) của DataFrame 'data'.
# Kết quả trả về một Series mới chứa các nhãn đã được biến đổi.
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [145]:
# sau đó GÁN KẾT QUẢ TRỞ LẠI cho index, THAY ĐỔI VĨNH VIỄN tên của các hàng.
data.index = data.index.map(transform)

# Hiển thị DataFrame sau khi index đã được đổi tên.
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [146]:
# - index=str.title: Áp dụng hàm str.title (viết hoa chữ cái đầu) cho TẤT CẢ nhãn hàng.
# - columns=str.upper: Áp dụng hàm str.upper (viết IN HOA tất cả) cho TẤT CẢ nhãn cột.
# Trả về một DataFrame MỚI với nhãn đã được đổi tên (không sửa DataFrame gốc).
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [148]:
data.rename(index={"OHIO": "INDIANA"},
            columns={"three": "peekaboo"})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [35]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [149]:
# Định nghĩa các điểm cắt: Tạo một list chứa các giới hạn trên của các khoảng tuổi (18, 25, 35, 60, 100).
bins = [18, 25, 35, 60, 100]

# Phân loại dữ liệu (Binning): Cắt Series 'ages' thành các khoảng (bin) được xác định bởi list 'bins'.
# Hàm pd.cut() tạo ra một đối tượng Categorical (thể hiện các danh mục tuổi).
age_categories = pd.cut(ages, bins)

# Hiển thị kết quả: In ra Series mới chứa các khoảng phân loại (ví dụ: (18, 25], (25, 35], ...).
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [151]:
age_categories.codes # Trích xuất các mã số nguyên (integers) thể hiện danh mục cho mỗi phần tử trong Series (ví dụ: 0, 1, 2...).
age_categories.categories # Trích xuất các nhãn danh mục (Categorical labels) duy nhất, được sắp xếp (ví dụ: (18, 25], (25, 35], ...).
age_categories.categories[0] # Lấy nhãn danh mục đầu tiên từ danh sách categories.
pd.value_counts(age_categories) # Đếm tần suất: Đếm số lượng phần tử rơi vào mỗi danh mục (bin) và trả về kết quả theo thứ tự từ lớn đến bé.

C:\Users\Dell\AppData\Local\Temp\ipykernel_5664\989956493.py:4: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories) # Đếm tần suất: Đếm số lượng phần tử rơi vào mỗi danh mục (bin) và trả về kết quả theo thứ tự từ lớn đến bé.

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [152]:
# Tham số 'right=False' làm cho các khoảng là BÁN KÍN ở phía bên phải (trái đóng, phải mở): [a, b).
# Nghĩa là, giá trị BÊN TRÊN (giới hạn phải) sẽ KHÔNG được bao gồm trong khoảng.
pd.cut(ages, bins, right=False)

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [153]:
# Định nghĩa nhãn cho các khoảng (bin) sau khi phân loại.
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]

# Phân loại dữ liệu (Binning): Cắt Series 'ages' thành các khoảng được xác định bởi 'bins'.
# Tham số 'labels=group_names' gán tên danh mục cho các khoảng thay vì hiển thị giới hạn số mặc định.
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [154]:
# Tạo một mảng NumPy 1 chiều chứa 20 số ngẫu nhiên, phân phối đồng đều trong khoảng [0, 1).
data = np.random.uniform(size=20)

# Phân loại dữ liệu (Binning): Cắt Series 'data' thành 4 khoảng (bin) CÓ KÍCH THƯỚC BẰNG NHAU.
# Tham số 'precision=2' làm tròn các điểm giới hạn của khoảng (bin edges) đến 2 chữ số thập phân.
pd.cut(data, 4, precision=2)

[(0.47, 0.68], (0.68, 0.9], (0.47, 0.68], (0.036, 0.25], (0.68, 0.9], ..., (0.47, 0.68], (0.68, 0.9], (0.036, 0.25], (0.25, 0.47], (0.036, 0.25]]
Length: 20
Categories (4, interval[float64, right]): [(0.036, 0.25] < (0.25, 0.47] < (0.47, 0.68] < (0.68, 0.9]]

In [155]:
# Tạo một mảng NumPy 1 chiều chứa 1000 số ngẫu nhiên theo phân phối chuẩn (Standard Normal Distribution).
data = np.random.standard_normal(1000)

# Phân vị (Quantile Binning): Cắt Series 'data' thành 4 khoảng (tứ phân vị - quartiles) CÓ SỐ LƯỢNG PHẦN TỬ BẰNG NHAU.
# Tham số 'precision=2' làm tròn các điểm giới hạn của khoảng (bin edges) đến 2 chữ số thập phân.
quartiles = pd.qcut(data, 4, precision=2)
quartiles # Hiển thị Series Categorical mới (chứa các khoảng tứ phân vị).

# Đếm tần suất: Đếm số lượng phần tử rơi vào mỗi khoảng tứ phân vị (mỗi khoảng sẽ có khoảng 250 phần tử)
pd.value_counts(quartiles)

C:\Users\Dell\AppData\Local\Temp\ipykernel_5664\3183492947.py:10: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.3899999999999997, -0.69]    250
(-0.69, 0.00089]                250
(0.00089, 0.66]                 250
(0.66, 2.56]                    250
Name: count, dtype: int64

In [42]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.]).value_counts()

(-2.9499999999999997, -1.187]    100
(-1.187, -0.0265]                400
(-0.0265, 1.286]                 400
(1.286, 3.928]                   100
Name: count, dtype: int64

In [156]:
# Tạo một DataFrame 1000x4 (1000 hàng, 4 cột):
# - Dữ liệu: 4000 số ngẫu nhiên theo phân phối chuẩn (Standard Normal Distribution).
data = pd.DataFrame(np.random.standard_normal((1000, 4)))

# Thống kê mô tả: Tính toán các thống kê mô tả tóm tắt cho TỪNG CỘT trong DataFrame 'data'.
# Các thống kê bao gồm: Count (Số lượng), Mean (Trung bình), Std (Độ lệch chuẩn), Min/Max, và các Tứ phân vị (25%, 50%, 75%).
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.021533    -0.004586     0.051148    -0.011561
std       0.998997     1.006512     1.014240     0.985540
min      -3.744510    -2.840129    -2.920387    -2.970954
25%      -0.616511    -0.638362    -0.662835    -0.667369
50%      -0.021402    -0.009823     0.060190    -0.016266
75%       0.671839     0.701238     0.739500     0.629366
max       3.431022     2.678638     3.157163     3.344638

In [160]:
# Chọn Cột có chỉ số 2 từ DataFrame 'data' và gán nó cho biến 'col' (Series).
col = data[2]

# Lọc dữ liệu: Chọn ra các phần tử trong Series 'col' mà giá trị tuyệt đối (.abs()) của chúng LỚN HƠN 3.
# Đây là cách để tìm ra các giá trị ngoại lai (outliers) hoặc các điểm dữ liệu bất thường.
col[col.abs() > 3]

Series([], Name: 2, dtype: float64)

In [163]:
# (data.abs() > 3): Tạo một DataFrame Boolean (True/False) nơi True chỉ ra các giá trị tuyệt đối lớn hơn 3.
# .any(axis="columns"): Kiểm tra TỪNG HÀNG (axis="columns" hoặc axis=1) trong DataFrame Boolean đó, trả về True nếu CÓ ÍT NHẤT MỘT giá trị True (tức là có ít nhất một giá trị ngoại lai).
# data[...]: Lọc DataFrame 'data' ban đầu để CHỈ giữ lại những HÀNG mà có ít nhất một giá trị ngoại lai (tức là giá trị tuyệt đối lớn hơn 3).
data[(data.abs() > 3).any(axis="columns")]

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [164]:
# 1. (data.abs() > 3): Tạo DataFrame Boolean, True cho các giá trị ngoại lai (giá trị tuyệt đối > 3).
# 2. np.sign(data): Trả về dấu của mỗi phần tử (1 cho dương, -1 cho âm, 0 cho 0).
# 3. np.sign(data) * 3: Nhân dấu với 3 (tức là 3.0 hoặc -3.0).
# 4. data[...] = ...: Gán giá trị 3.0 hoặc -3.0 CHO TẤT CẢ các vị trí được đánh dấu là True (giá trị ngoại lai).
# Mục đích: Thay thế tất cả các giá trị tuyệt đối > 3 bằng 3.0 hoặc -3.0, giữ nguyên dấu.
data[data.abs() > 3] = np.sign(data) * 3

# Thống kê mô tả: Tính toán lại các thống kê tóm tắt cho DataFrame sau khi đã loại bỏ/giới hạn các giá trị ngoại lai.
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.022065    -0.004586     0.050957    -0.011906
std       0.992300     1.006512     1.013671     0.984425
min      -3.000000    -2.840129    -2.920387    -2.970954
25%      -0.616511    -0.638362    -0.662835    -0.667369
50%      -0.021402    -0.009823     0.060190    -0.016266
75%       0.671839     0.701238     0.739500     0.629366
max       3.000000     2.678638     3.000000     3.000000

In [47]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1  1.0 -1.0  1.0 -1.0
2  1.0  1.0  1.0 -1.0
3 -1.0 -1.0  1.0 -1.0
4 -1.0  1.0 -1.0 -1.0

In [166]:
# Tạo một DataFrame 5x7:
# - Dữ liệu: Các số nguyên từ 0 đến 34, được sắp xếp thành 5 hàng và 7 cột (dùng np.arange(5 * 7).reshape((5, 7))).
df = pd.DataFrame(np.arange(5 * 7).reshape((5, 7)))
df # Hiển thị DataFrame vừa tạo.

# Tạo một mảng NumPy chứa 5 số nguyên từ 0 đến 4 (tương ứng với số hàng của DataFrame)
# ở trạng thái ĐƯỢC XÁO TRỘN NGẪU NHIÊN (random permutation).
# Mảng này sẽ được dùng để chọn mẫu hoặc sắp xếp lại các hàng của DataFrame.
sampler = np.random.permutation(5)
sampler # Hiển thị mảng các chỉ số đã được xáo trộn.

array([4, 1, 2, 0, 3], dtype=int32)

In [167]:
# Sắp xếp lại hàng bằng phương thức .take(): Lấy các hàng từ DataFrame 'df' theo thứ tự chỉ mục được chỉ định trong 'sampler'.
# Kết quả: Các hàng của DataFrame được xáo trộn ngẫu nhiên theo trật tự của 'sampler'.
df.take(sampler)

# Sắp xếp lại hàng bằng chỉ mục vị trí (.iloc): Tương đương với df.take(sampler).
# Lấy các hàng từ DataFrame 'df' theo thứ tự vị trí (integer location) được chỉ định trong 'sampler'.
df.iloc[sampler]

    0   1   2   3   4   5   6
4  28  29  30  31  32  33  34
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20
0   0   1   2   3   4   5   6
3  21  22  23  24  25  26  27

In [168]:
# Tạo một mảng NumPy chứa 7 số nguyên từ 0 đến 6 (tương ứng với số cột của DataFrame)
# ở trạng thái ĐƯỢC XÁO TRỘN NGẪU NHIÊN. Mảng này sẽ được dùng để sắp xếp lại các cột.
column_sampler = np.random.permutation(7)
column_sampler # Hiển thị mảng các chỉ số cột đã được xáo trộn.

# Sắp xếp lại CỘT (column) bằng phương thức .take(): Lấy các cột từ DataFrame 'df' theo thứ tự chỉ mục
# được chỉ định trong 'column_sampler' (axis="columns" hoặc axis=1).
# Kết quả: Các cột của DataFrame được xáo trộn ngẫu nhiên.
df.take(column_sampler, axis="columns")

    5   1   6   2   4   0   3
0   5   1   6   2   4   0   3
1  12   8  13   9  11   7  10
2  19  15  20  16  18  14  17
3  26  22  27  23  25  21  24
4  33  29  34  30  32  28  31

In [169]:
df.sample(n=3) # Chọn mẫu ngẫu nhiên: Chọn ngẫu nhiên 3 HÀNG (rows) từ DataFrame 'df' (mặc định không thay thế).

    0   1   2   3   4   5   6
0   0   1   2   3   4   5   6
1   7   8   9  10  11  12  13
2  14  15  16  17  18  19  20

In [170]:
# Tạo một Series Pandas chứa 5 giá trị số.
choices = pd.Series([5, 7, -1, 6, 4])

# Chọn mẫu ngẫu nhiên có THAY THẾ:
# - n=10: Chọn 10 phần tử.
# - replace=True: Cho phép MỘT PHẦN TỬ được chọn LẶP LẠI (quan trọng vì n > số phần tử ban đầu là 5).
choices.sample(n=10, replace=True)

1    7
4    4
1    7
4    4
4    4
3    6
2   -1
1    7
1    7
4    4
dtype: int64

In [171]:
# Tạo một DataFrame 6x2:
# - Cột "key" chứa các giá trị danh mục lặp lại ("b", "b", "a", "c", "a", "b").
# - Cột "data1" chứa các số nguyên từ 0 đến 5.
df = pd.DataFrame({"key": ["b", "b", "a", "c", "a", "b"],
                   "data1": range(6)})
df # Hiển thị DataFrame vừa tạo.

# Mã hóa One-Hot (One-Hot Encoding): Chuyển cột danh mục "key" thành các CỘT NHỊ PHÂN (dummy variables).
# - Mỗi giá trị duy nhất ("a", "b", "c") trong cột "key" trở thành một cột mới.
# - Giá trị là 1.0 (vì dtype=float) nếu hàng đó thuộc danh mục đó, ngược lại là 0.0.
pd.get_dummies(df["key"], dtype=float)

     a    b    c
0  0.0  1.0  0.0
1  0.0  1.0  0.0
2  1.0  0.0  0.0
3  0.0  0.0  1.0
4  1.0  0.0  0.0
5  0.0  1.0  0.0

In [172]:
# Mã hóa One-Hot (One-Hot Encoding) và Thêm tiền tố:
# - pd.get_dummies(...): Chuyển cột danh mục "key" thành các cột nhị phân (biến giả).
# - prefix="key": Thêm tiền tố 'key_' vào tên các cột mới (ví dụ: key_a, key_b, key_c) để dễ nhận dạng.
# - dtype=float: Đặt kiểu dữ liệu của biến giả là số thập phân (1.0 hoặc 0.0).
dummies = pd.get_dummies(df["key"], prefix="key", dtype=float)

# Kết hợp DataFrame:
# - df[["data1"]]: Chọn cột "data1" (dữ liệu ban đầu) làm nền.
# - .join(dummies): Kết hợp DataFrame gốc (chỉ cột "data1") với các cột biến giả mới ('dummies') dựa trên chỉ mục hàng.
df_with_dummy = df[["data1"]].join(dummies)

# Hiển thị DataFrame kết hợp (chứa cột dữ liệu gốc và các cột biến giả).
df_with_dummy

   data1  key_a  key_b  key_c
0      0    0.0    1.0    0.0
1      1    0.0    1.0    0.0
2      2    1.0    0.0    0.0
3      3    0.0    0.0    1.0
4      4    1.0    0.0    0.0
5      5    0.0    1.0    0.0

In [175]:
# Định nghĩa tên cột cho DataFrame
mnames = ["movie_id", "title", "genres"]

# Đọc dữ liệu từ file "movies.dat" (file dữ liệu MovieLens):
# - sep="::": Dùng ký tự "::" làm dấu phân cách (delimiter).
# - header=None: Không có dòng tiêu đề (header) trong file.
# - names=mnames: Gán tên cột được định nghĩa bởi list 'mnames'.
# - engine="python": Bắt buộc sử dụng engine 'python' vì dấu phân cách là nhiều ký tự ("Sử dụng engine='python' vì dấu phân cách là nhiều ký tự").
movies = pd.read_table("../lap02/datasets/movielens/movies.dat", sep="::",
                       header=None, names=mnames, engine="python")

# Hiển thị 10 dòng (rows) đầu tiên của DataFrame 'movies' để kiểm tra dữ liệu.
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [176]:
# - .str.get_dummies("|"): Tách chuỗi trong cột 'genres' bằng dấu phân cách "|" (dấu gạch đứng).
# - Mỗi thể loại duy nhất ("Action", "Adventure", v.v.) trở thành một cột nhị phân (0 hoặc 1).
dummies = movies["genres"].str.get_dummies("|")

# Hiển thị 10 hàng (rows) đầu tiên và 6 cột (columns) đầu tiên của DataFrame 'dummies' vừa tạo.
dummies.iloc[:10, :6]

   Action  Adventure  Animation  Children's  Comedy  Crime
0       0          0          1           1       1      0
1       0          1          0           1       0      0
2       0          0          0           0       1      0
3       0          0          0           0       1      0
4       0          0          0           0       1      0
5       1          0          0           0       0      1
6       0          0          0           0       1      0
7       0          1          0           1       0      0
8       1          0          0           0       0      0
9       1          1          0           0       0      0

In [177]:
# - dummies.add_prefix("Genre_"): Thêm tiền tố 'Genre_' vào tên các cột trong DataFrame 'dummies' (ví dụ: Genre_Action).
# - movies.join(...): Kết hợp DataFrame 'movies' gốc với các cột biến giả đã được đổi tên (dummies) dựa trên chỉ mục hàng (index).
movies_windic = movies.join(dummies.add_prefix("Genre_"))

# Hiển thị hàng đầu tiên (chỉ số 0) của DataFrame mới 'movies_windic'.
# Hàng này sẽ chứa thông tin phim gốc (movie_id, title, genres) KÈM THEO tất cả các cột Genre_... nhị phân (0 hoặc 1).
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
genres               Animation|Children's|Comedy
Genre_Action                                   0
Genre_Adventure                                0
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Crime                                    0
Genre_Documentary                              0
Genre_Drama                                    0
Genre_Fantasy                                  0
Genre_Film-Noir                                0
Genre_Horror                                   0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Romance                                  0
Genre_Sci-Fi                                   0
Genre_Thriller                                 0
Genre_War                                      0
Genre_Western                                  0
Name: 0, dtype: object

In [179]:
# Thiết lập seed để đảm bảo các số ngẫu nhiên được tạo ra luôn giống nhau mỗi lần chạy.
np.random.seed(12345) 

# Tạo một Series chứa 10 số ngẫu nhiên, phân phối đồng đều trong khoảng [0, 1).
values = np.random.uniform(size=10)
values # Hiển thị Series các giá trị ngẫu nhiên.

# Định nghĩa các điểm cắt (bins) để chia dữ liệu thành 5 khoảng đều nhau.
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

# Phân loại (pd.cut) và Mã hóa One-Hot (pd.get_dummies):
# 1. pd.cut(values, bins): Cắt Series 'values' thành 5 khoảng (bins) đã định nghĩa.
# 2. pd.get_dummies(...): Mã hóa One-Hot (One-Hot Encoding) kết quả: Mỗi khoảng (bin) trở thành một cột nhị phân (0 hoặc 1).
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

In [180]:
# Tạo một Series chứa các số nguyên và một giá trị thiếu (None).
# Khi kết hợp số nguyên và None (hoặc np.nan), Pandas tự động chuyển kiểu sang 'float64'
# để có thể biểu diễn giá trị thiếu (NaN).
s = pd.Series([1, 2, 3, None])
s # Hiển thị Series

# Truy cập thuộc tính .dtype để kiểm tra kiểu dữ liệu của Series.
s.dtype # Kết quả sẽ là 'float64' (hoặc tương đương)

dtype('float64')

In [181]:
# Tạo một Series chứa các số nguyên và một giá trị thiếu (None).
# QUAN TRỌNG: Sử dụng dtype=pd.Int64Dtype() (hoặc "Int64") để sử dụng kiểu dữ liệu Integer có hỗ trợ giá trị thiếu (nullable integer dtype).
s = pd.Series([1, 2, 3, None], dtype=pd.Int64Dtype())
s # Hiển thị Series (Lưu ý kiểu dữ liệu sau mỗi giá trị: <Int64>)

# Kiểm tra giá trị thiếu: Trả về một Series Boolean, True cho các vị trí chứa giá trị thiếu.
# Trong Series Integer có hỗ trợ giá trị thiếu, giá trị thiếu vẫn được biểu diễn là <NA> (tương đương NaN/None).
s.isna()

# Truy cập thuộc tính .dtype để kiểm tra kiểu dữ liệu của Series.
s.dtype # Kết quả sẽ là 'Int64' (kiểu Integer có hỗ trợ giá trị thiếu)

Int64Dtype()

In [182]:
# Lấy giá trị tại chỉ mục 3 (phần tử cuối cùng) của Series 's'.
# Giá trị này được biểu diễn là <NA> (giá trị thiếu của Pandas).
s[3]

# 2. Kiểm tra giá trị thiếu:
# Kiểm tra xem giá trị s[3] (tức là <NA>) có phải là hằng số pd.NA (giá trị thiếu chuyên dụng của Pandas) hay không.
# Kết quả sẽ là True.
s[3] is pd.NA

True

In [183]:
# Tạo một Series chứa các số nguyên và một giá trị thiếu (None).
# QUAN TRỌNG: Sử dụng dtype="Int64" (viết hoa 'I') để kích hoạt kiểu dữ liệu Integer có hỗ trợ giá trị thiếu (nullable integer dtype).
s = pd.Series([1, 2, 3, None], dtype="Int64")
s # Hiển thị Series (Lưu ý kiểu dữ liệu Int64 ở cuối)

0       1
1       2
2       3
3    <NA>
dtype: Int64

In [184]:
# Tạo một Series chứa các chuỗi và một giá trị thiếu (None).
# QUAN TRỌNG: Sử dụng dtype=pd.StringDtype() (hoặc "string") để kích hoạt kiểu dữ liệu String (chuỗi) có hỗ trợ giá trị thiếu.
s = pd.Series(['one', 'two', None, 'three'], dtype=pd.StringDtype())
s # Hiển thị Series (Lưu ý kiểu dữ liệu StringDtype ở cuối)

0      one
1      two
2     <NA>
3    three
dtype: string

In [185]:
# 1. Tạo DataFrame gốc:
# DataFrame này chứa các giá trị thiếu (None) ở các cột khác nhau.
# Theo mặc định, Pandas sẽ ép kiểu cột A thành float64 và B thành object.
df = pd.DataFrame({"A": [1, 2, None, 4],
                   "B": ["one", "two", "three", None],
                   "C": [False, None, False, True]})
df # Hiển thị DataFrame gốc

# 2. Ép kiểu sang kiểu dữ liệu có thể null (Nullable Dtypes):
# - "Int64": Integer có thể null (chứa <NA> thay vì NaN).
df["A"] = df["A"].astype("Int64") 
# - "string": String có thể null (chứa <NA> thay vì None/NaN).
df["B"] = df["B"].astype("string")
# - "boolean": Boolean có thể null (chứa <NA> thay vì False/True).
df["C"] = df["C"].astype("boolean")

df # Hiển thị DataFrame sau khi ép kiểu (Lưu ý các dtype Int64, string, boolean ở cuối)

      A      B      C
0     1    one  False
1     2    two   <NA>
2  <NA>  three  False
3     4   <NA>   True

In [186]:
# Định nghĩa một chuỗi (string) có chứa dấu phẩy (,) và khoảng trắng không mong muốn (space).
val = "a,b, guido"
val # Hiển thị chuỗi gốc

# Tách chuỗi (split): Sử dụng phương thức .split(",") để chia chuỗi 'val' thành một list các chuỗi con,
# sử dụng dấu phẩy (,) làm dấu phân cách. Khoảng trắng sau dấu phẩy sẽ được giữ lại.
val.split(",")

['a', 'b', ' guido']

In [59]:
pieces = [x.strip() for x in val.split(",")]
pieces

['a', 'b', 'guido']

In [187]:
# Gán biến: Giải nén (unpacking) 3 phần tử của list 'pieces' vào 3 biến riêng biệt: first, second, và third.
first, second, third = pieces

# Nối chuỗi (String Concatenation): Nối ba chuỗi đã được gán biến với nhau,
# sử dụng ký tự "::" làm dấu phân cách (delimiter).
first + "::" + second + "::" + third

'a::b::guido'

In [188]:
# Nối chuỗi (String Joining): Sử dụng phương thức .join() trên chuỗi "::" để nối TẤT CẢ các phần tử trong list 'pieces' lại với nhau,
# sử dụng chuỗi "::" làm dấu phân cách (delimiter) giữa các phần tử.
"::".join(pieces)

'a::b::guido'

In [189]:
"guido" in val
val.index(",")
val.find(":")

-1

In [190]:
val.index(":")

ValueError: substring not found

In [191]:
val.count(",")

2

In [192]:
val.replace(",", "::")
val.replace(",", "")

'ab guido'

In [193]:
import re
text = "foo    bar\t baz  \tqux"
re.split(r"\s+", text)

['foo', 'bar', 'baz', 'qux']

In [194]:
regex = re.compile(r"\s+")
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [195]:
regex.findall(text)

['    ', '\t ', '  \t']

In [196]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com"""
pattern = r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

# re.IGNORECASE makes the regex case insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [197]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [198]:
m = regex.search(text)
m
text[m.start():m.end()]

'dave@google.com'

In [199]:
print(regex.match(text))

None

In [200]:
print(regex.sub("REDACTED", text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [201]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
regex = re.compile(pattern, flags=re.IGNORECASE)

In [202]:
m = regex.match("wesm@bright.net")
m.groups()

('wesm', 'bright', 'net')

In [203]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [204]:
print(regex.sub(r"Username: \1, Domain: \2, Suffix: \3", text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [205]:
data = {"Dave": "dave@google.com", "Steve": "steve@gmail.com",
        "Rob": "rob@gmail.com", "Wes": np.nan}
data = pd.Series(data)
data
data.isna()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [206]:
data.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [207]:
data_as_string_ext = data.astype('string')
data_as_string_ext
data_as_string_ext.str.contains("gmail")

Dave     False
Steve     True
Rob       True
Wes       <NA>
dtype: boolean

In [208]:
pattern = r"([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})"
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [209]:
matches = data.str.findall(pattern, flags=re.IGNORECASE).str[0]
matches
matches.str.get(1)

Dave     google
Steve     gmail
Rob       gmail
Wes         NaN
dtype: object

In [210]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

In [211]:
data.str.extract(pattern, flags=re.IGNORECASE)

           0       1    2
Dave    dave  google  com
Steve  steve   gmail  com
Rob      rob   gmail  com
Wes      NaN     NaN  NaN

In [212]:
values = pd.Series(['apple', 'orange', 'apple',
                    'apple'] * 2)
values
pd.unique(values)
pd.value_counts(values)

C:\Users\Dell\AppData\Local\Temp\ipykernel_5664\3503291848.py:5: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(values)

apple     6
orange    2
Name: count, dtype: int64

In [213]:
values = pd.Series([0, 1, 0, 0] * 2)
dim = pd.Series(['apple', 'orange'])
values
dim

0     apple
1    orange
dtype: object

In [214]:
dim.take(values)

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [215]:
fruits = ['apple', 'orange', 'apple', 'apple'] * 2
N = len(fruits)
rng = np.random.default_rng(seed=12345)
df = pd.DataFrame({'fruit': fruits,
                   'basket_id': np.arange(N),
                   'count': rng.integers(3, 15, size=N),
                   'weight': rng.uniform(0, 4, size=N)},
                  columns=['basket_id', 'fruit', 'count', 'weight'])
df

   basket_id   fruit  count    weight
0          0   apple     11  1.564438
1          1  orange      5  1.331256
2          2   apple     12  2.393235
3          3   apple      6  0.746937
4          4   apple      5  2.691024
5          5  orange     12  3.767211
6          6   apple     10  0.992983
7          7   apple     11  3.795525

In [216]:
fruit_cat = df['fruit'].astype('category')
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [217]:
c = fruit_cat.array
type(c)

pandas.core.arrays.categorical.Categorical

In [218]:
c.categories
c.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [219]:
dict(enumerate(c.categories))

{0: 'apple', 1: 'orange'}

In [220]:
df['fruit'] = df['fruit'].astype('category')
df["fruit"]

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): ['apple', 'orange']

In [221]:
my_categories = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])
my_categories

['foo', 'bar', 'baz', 'foo', 'bar']
Categories (3, object): ['bar', 'baz', 'foo']

In [222]:
categories = ['foo', 'bar', 'baz']
codes = [0, 1, 2, 0, 0, 1]
my_cats_2 = pd.Categorical.from_codes(codes, categories)
my_cats_2

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo', 'bar', 'baz']

In [223]:
ordered_cat = pd.Categorical.from_codes(codes, categories,
                                        ordered=True)
ordered_cat

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [224]:
my_cats_2.as_ordered()

['foo', 'bar', 'baz', 'foo', 'foo', 'bar']
Categories (3, object): ['foo' < 'bar' < 'baz']

In [225]:
rng = np.random.default_rng(seed=12345)
draws = rng.standard_normal(1000)
draws[:5]

array([-1.4238,  1.2637, -0.8707, -0.2592, -0.0753])

In [226]:
bins = pd.qcut(draws, 4)
bins

[(-3.121, -0.675], (0.687, 3.211], (-3.121, -0.675], (-0.675, 0.0134], (-0.675, 0.0134], ..., (0.0134, 0.687], (0.0134, 0.687], (-0.675, 0.0134], (0.0134, 0.687], (-0.675, 0.0134]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.121, -0.675] < (-0.675, 0.0134] < (0.0134, 0.687] < (0.687, 3.211]]

In [227]:
bins = pd.qcut(draws, 4, labels=['Q1', 'Q2', 'Q3', 'Q4'])
bins
bins.codes[:10]

array([0, 3, 0, 1, 1, 0, 0, 2, 2, 0], dtype=int8)

In [228]:
bins = pd.Series(bins, name='quartile')
results = (pd.Series(draws)
           .groupby(bins)
           .agg(['count', 'min', 'max'])
           .reset_index())
results

C:\Users\Dell\AppData\Local\Temp\ipykernel_5664\2483392743.py:3: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  .groupby(bins)

  quartile  count       min       max
0       Q1    250 -3.119609 -0.678494
1       Q2    250 -0.673305  0.008009
2       Q3    250  0.018753  0.686183
3       Q4    250  0.688282  3.211418

In [229]:
results['quartile']

0    Q1
1    Q2
2    Q3
3    Q4
Name: quartile, dtype: category
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [230]:
N = 10_000_000
labels = pd.Series(['foo', 'bar', 'baz', 'qux'] * (N // 4))

In [231]:
categories = labels.astype('category')

In [232]:
labels.memory_usage(deep=True)
categories.memory_usage(deep=True)

10000512

In [233]:
%time _ = labels.astype('category')

CPU times: total: 672 ms
Wall time: 714 ms

In [234]:
%timeit labels.value_counts()
%timeit categories.value_counts()

636 ms ± 36.5 ms per loop (mean ± std. dev. of 7 runs, 1 loop each)
92.1 ms ± 1.62 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)

In [235]:
s = pd.Series(['a', 'b', 'c', 'd'] * 2)
cat_s = s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): ['a', 'b', 'c', 'd']

In [236]:
cat_s.cat.codes
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [237]:
actual_categories = ['a', 'b', 'c', 'd', 'e']
cat_s2 = cat_s.cat.set_categories(actual_categories)
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): ['a', 'b', 'c', 'd', 'e']

In [238]:
cat_s.value_counts()
cat_s2.value_counts()

a    2
b    2
c    2
d    2
e    0
Name: count, dtype: int64

In [239]:
cat_s3 = cat_s[cat_s.isin(['a', 'b'])]
cat_s3
cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): ['a', 'b']

In [240]:
cat_s = pd.Series(['a', 'b', 'c', 'd'] * 2, dtype='category')

In [241]:
pd.get_dummies(cat_s, dtype=float)

     a    b    c    d
0  1.0  0.0  0.0  0.0
1  0.0  1.0  0.0  0.0
2  0.0  0.0  1.0  0.0
3  0.0  0.0  0.0  1.0
4  1.0  0.0  0.0  0.0
5  0.0  1.0  0.0  0.0
6  0.0  0.0  1.0  0.0
7  0.0  0.0  0.0  1.0

In [242]:
pd.options.display.max_rows = PREVIOUS_MAX_ROWS